//SORTJOB JOB 'SORT',CLASS=A,MSGCLASS=A
//STEP1   EXEC PGM=SORT
//SYSOUT    DD SYSOUT=*
//SORTIN    DD *
10
07
08
09
01
05
//SORTOUT   DD SYSOUT=*
//SYSIN     DD *
  SORT FIELDS=(1,2,CH,A)
/*
